//
//  FilterDatas.swift
//  ChaRo-iOS
//
//  Created by 장혜령 on 2021/07/11.
//

import Foundation

struct FilterDatas {
    let state: [String] = [ "선택안함", "특별시", "광역시", "경기도", "강원도", "충청남도", "충청북도", "경상북도", "경상남도", "전라북도", "전라남도"]
    let cityDict: [String: [String]] = ["특별시" : ["서울", "제주"] ,
                                        "광역시": [ "부산", "대구", "인천", "울산", "대전", "광주"],
                                        
                                        "경기도" : ["가평", "고양", "과천", "광명", "광주", "구리", "군포", "김포", "남양주", "동두천", "부천",            "성남", "수원", "시흥", "안산", "안성", "안양", "양주", "양평", "여주", "연천", "오산", "용인", "의왕",
                                                       "의정부", "이천", "파주", "평택", "포천", "하남", "화성"],
                                        
                                        "강원도" : ["고성", "강릉", "동해", "삼척", "속초", "양구", "양양", "영월", "원주", "인제", "정선", "철원", "춘천",        "태백", "평창", "홍천", "화천", "횡성"],
                                        
                                        "충청남도" : [  "계룡", "공주", "금산", "논산", "당진", "보령", "부여", "서산", "서천", "아산", "예산",              "천안", "청양", "태안", "홍성"],
                                        
                                        "충청북도" : ["괴산", "단양", "보은", "영동", "옥천", "음성", "제천", "증평", "진천", "청주", "충주"],
                                        
                                        "경상북도" : ["경산", "경주", "고령", "구미", "군위", "김천", "독도", "문경", "봉화", "상주", "성주", "안동",          "영덕", "영양", "영주", "영천", "예천", "울릉", "울진", "의성", "청도", "청송", "칠곡", "포항"],
                                        
                                        "경상남도" : ["거제", "거창", "고성", "김해", "남해", "밀양", "사천", "산청", "양산", "의령", "진주", "창녕", "창원", "통영", "하동", "함안", "함양", "합천"],
                                        
                                        "전라북도" : ["고창", "군산", "김제", "남원", "무주", "부안", "순창", "완주", "익산", "임실", "장수", "전주", "정읍", "진안"],
                                        
                                        "전라남도" : ["강진", "고흥", "곡성", "광양", "구례", "나주", "담양", "목포", "무안", "보성", "순천", "신안", "여수", "영광", "영암", "완도", "장성", "장흥", "진도", "함평", "해남", "화순"]]
    
    let thema: [String] = ["선택안함", "산", "바다", "호수", "강", "봄", "여름", "가을", "겨울", "해안도로", "벚꽃", "단풍", "여유", "스피드", "야경", "도심"]
    let caution: [String] = ["선택안함", "고속도로", "사람많음", "산길포함", "초보힘듦"]
   
}
